NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/MGM24/MGM240SB22VNA.svd
        <register>
          <name>IFPGACTRL</name>
          <description>No Description</description>
          <addressOffset>0x0B4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FF80000</resetMask>
          <fields>
            <field>
              <name>DCCALON</name>
              <description>Enable/Disable DCCAL in DEMOD</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>DC ESTI DISABLED</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>DC ESTI ENABLED</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCRSTEN</name>
              <description>DC Compensation Filter Reset Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>DC Comp out of Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>DC Comp in Reset</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCESTIEN</name>
              <description>DCESTIEN Override for RAC</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>DCESTI Disabled in MODEM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>DCESTI Enabled in MODEM</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCALDEC0</name>
              <description>DEC0 Value for DCCAL</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DF3</name>
                  <description>Decimation Factor 0 = 3. Cutoff 0.050 * f&lt;subscript&gt;HFXO&lt;/subscript&gt;.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DF4WIDE</name>
                  <description>Decimation Factor 0 = 4. Cutoff 0.069 * f&lt;subscript&gt;HFXO&lt;/subscript&gt;.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DF4NARROW</name>
                  <description>Decimation Factor 0 = 4. Cutoff 0.037 * f&lt;subscript&gt;HFXO&lt;/subscript&gt;.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DF8WIDE</name>
                  <description>Decimation Factor 0 = 8. Cutoff 0.012 * f&lt;subscript&gt;HFXO&lt;/subscript&gt;.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DF8NARROW</name>
                  <description>Decimation Factor 0 = 8. Cutoff 0.005 * f&lt;subscript&gt;HFXO&lt;/subscript&gt;.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCALDCGEAR</name>
              <description>DC COMP GEAR Value for DCCAL</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAENCTRL</name>
          <description>No Description</description>
          <addressOffset>0x0B8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00070100</resetMask>
          <fields>
            <field>
              <name>PARAMP</name>
              <description>PA output level ramping</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INVRAMPCLK</name>
              <description>Invert PA ramping clock</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIV2RAMPCLK</name>
              <description>Div PA ramping clock by 2</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTDIV2RAMPCLK</name>
              <description>Reset Div2 PA ramping clock</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APC</name>
          <description>No Description</description>
          <addressOffset>0x0BC</addressOffset>
          <access>read-write</access>
          <resetValue>0xFF000000</resetValue>
          <resetMask>0xFF000004</resetMask>
          <fields>
            <field>
              <name>ENAPCSW</name>
              <description>software control bit for apc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AMPCONTROLLIMITSW</name>
              <description>software amp_control top limit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANTDIV</name>
          <description>No Description</description>
          <addressOffset>0x0C0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FBD</resetMask>
          <fields>
            <field>
              <name>INTDIVLNAMIXEN0</name>
              <description>INTDIVLNAMIXEN0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTDIVLNAMIXRFATTDCEN0</name>
              <description>INTDIVLNAMIXRFATTDCEN0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTDIVLNAMIXRFPKDENRF0</name>
              <description>INTDIVLNAMIXRFPKDENRF0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTDIVSYLODIVRLO02G4EN</name>
              <description>INTDIVSYLODIVRLO02G4EN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTDIVLNAMIXEN1</name>
              <description>INTDIVLNAMIXEN1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTDIVLNAMIXRFATTDCEN1</name>
              <description>INTDIVLNAMIXRFATTDCEN1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTDIVLNAMIXRFPKDENRF1</name>
              <description>INTDIVLNAMIXRFPKDENRF1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTDIVSYLODIVRLO12G4EN</name>
              <description>INTDIVSYLODIVRLO12G4EN</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANTDIVSTATUS</name>
              <description>ANTDIVSTATUS</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Both antenna disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANT1</name>
                  <description>Antenna 0 enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANT2</name>
                  <description>Antenna 1 enabled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both Antenna enabled</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
